{
  "_name_or_path": "sadickam/sdg-classification-bert",
  "_num_labels": 16,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "sdg1",
    "1": "sdg2",
    "2": "sdg3",
    "3": "sdg4",
    "4": "sdg5",
    "5": "sdg6",
    "6": "sdg7",
    "7": "sdg8",
    "8": "sdg9",
    "9": "sdg10",
    "10": "sdg11",
    "11": "sdg12",
    "12": "sdg13",
    "13": "sdg14",
    "14": "sdg15",
    "15": "sdg16"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "sdg1": 0,
    "sdg10": 9,
    "sdg11": 10,
    "sdg12": 11,
    "sdg13": 12,
    "sdg14": 13,
    "sdg15": 14,
    "sdg16": 15,
    "sdg2": 1,
    "sdg3": 2,
    "sdg4": 3,
    "sdg5": 4,
    "sdg6": 5,
    "sdg7": 6,
    "sdg8": 7,
    "sdg9": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.32.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
